lkolbly/cmsis-svd/data/NXP/LPC5514.svd
        <register>
          <name>RX_SET</name>
          <description>USB PHY Receiver Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>The ENVADJ field adjusts the trip point for the envelope detector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Trip-Level Voltage is 0.1000 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Trip-Level Voltage is 0.1125 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Trip-Level Voltage is 0.1250 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Trip-Level Voltage is 0.0875 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>The DISCONADJ field adjusts the trip point for the disconnect detector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Trip-Level Voltage is 0.56875 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Trip-Level Voltage is 0.55000 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Trip-Level Voltage is 0.58125 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Trip-Level Voltage is 0.60000 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>This test mode is intended for lab use only, replace FS differential receiver with DP single ended receiver</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Use the output of the USB_DP single-ended receiver in place of the full-speed differential receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CLR</name>
          <description>USB PHY Receiver Control Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>The ENVADJ field adjusts the trip point for the envelope detector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Trip-Level Voltage is 0.1000 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Trip-Level Voltage is 0.1125 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Trip-Level Voltage is 0.1250 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Trip-Level Voltage is 0.0875 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>The DISCONADJ field adjusts the trip point for the disconnect detector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Trip-Level Voltage is 0.56875 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Trip-Level Voltage is 0.55000 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Trip-Level Voltage is 0.58125 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Trip-Level Voltage is 0.60000 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>This test mode is intended for lab use only, replace FS differential receiver with DP single ended receiver</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Use the output of the USB_DP single-ended receiver in place of the full-speed differential receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_TOG</name>
          <description>USB PHY Receiver Control Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>The ENVADJ field adjusts the trip point for the envelope detector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Trip-Level Voltage is 0.1000 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Trip-Level Voltage is 0.1125 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Trip-Level Voltage is 0.1250 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Trip-Level Voltage is 0.0875 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>The DISCONADJ field adjusts the trip point for the disconnect detector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Trip-Level Voltage is 0.56875 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Trip-Level Voltage is 0.55000 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Trip-Level Voltage is 0.58125 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Trip-Level Voltage is 0.60000 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>This test mode is intended for lab use only, replace FS differential receiver with DP single ended receiver</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Use the output of the USB_DP single-ended receiver in place of the full-speed differential receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>USB PHY General Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENHOSTDISCONDETECT</name>
              <description>For host mode, enables high-speed disconnect detector</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQHOSTDISCON</name>
              <description>Enable IRQ for Host disconnect: Enables interrupt for detection of disconnection to Device when in high-speed host mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOSTDISCONDETECT_IRQ</name>
              <description>Indicates that the device has disconnected in High-Speed mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDEVPLUGINDET</name>
              <description>Enables non-standard resistive plugged-in detection This bit field controls connection of nominal 200kohm resistors to both the USB_DP and USB_DM pins as one method of detecting when a USB cable is attached in device mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Disables 200kohm pullup resistors on USB_DP and USB_DM pins (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Enables 200kohm pullup resistors on USB_DP and USB_DM pins</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVPLUGIN_POLARITY</name>
              <description>Device plugin polarity: For device mode, if this bit is cleared to 0, then it trips the interrupt if the device is plugged in</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUMEIRQSTICKY</name>
              <description>Resume IRQ: Set to 1 will make RESUME_IRQ bit a sticky bit until software clear it</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQRESUMEDETECT</name>
              <description>Enable IRQ Resume detect: Enables interrupt for detection of a non-J state on the USB line</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUME_IRQ</name>
              <description>Resume IRQ: Indicates that the host is sending a wake-up after suspend</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVPLUGIN_IRQ</name>
              <description>Indicates that the device is connected</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENUTMILEVEL2</name>
              <description>Enables UTMI+ Level 2 operation for the USB HS PHY</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENUTMILEVEL3</name>
              <description>Enables UTMI+ Level 3 operation for the USB HS PHY</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQWAKEUP</name>
              <description>Enable wake-up IRQ: Enables interrupt for the wake-up events.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_IRQ</name>
              <description>Wake-up IRQ: Indicates that there is a wak-eup event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTORESUME_EN</name>
              <description>Enable the auto resume feature, when set, HW will use 32KHz clock to send Resume to respond to the device remote wakeup(for host mode only)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAUTOCLR_CLKGATE</name>
              <description>Enables the feature to auto-clear the CLKGATE bit if there is wakeup event while USB is suspended</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAUTOCLR_PHY_PWD</name>
              <description>Enables the feature to auto-clear the PWD register bits in PWD if there is wakeup event while USB is suspended</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPDMCHG_WKUP</name>
              <description>Enable DP DM change wake-up: Not for customer use</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENVBUSCHG_WKUP</name>
              <description>Enable VBUS change wake-up: Enables the feature to wake-up USB if VBUS is toggled when USB is suspended</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAUTOCLR_USBCLKGATE</name>
              <description>Enable auto-clear USB Clock gate: Enables the feature to auto-clear the USB0_CLKGATE/USB1_CLKGATE register bit in HW_DIGCTL_CTRL if there is wake-up event on USB0/USB1 while USB0/USB1 is suspended</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAUTOSET_USBCLKS</name>
              <description>Enable auto-set of USB clocks: Enables the feature to auto-clear the EN_USB_CLKS register bits in HW_CLKCTRL_PLL1CTRL0/HW_CLKCTRL_P LL1CTRL1 if there is wake-up event on USB0/USB1 while USB0/USB1 is suspended</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_FORCE_LS_SE0</name>
              <description>Forces the next FS packet that is transmitted to have a EOP with low-speed timing</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_SUSPENDM</name>
              <description>Used by the PHY to indicate a powered-down state</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>Gate UTMI Clocks</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Writing a 1 to this bit will soft-reset the PWD, TX, RX, and CTRL registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
